chore: merge master into wider-mice-support
